app/controllers/comments_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 301]]
INSERT INTO "comments" ("content", "user_id", "entry_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "FF"], ["user_id", 101], ["entry_id", 301], ["created_at", "2016-09-20 16:52:50.950235"], ["updated_at", "2016-09-20 16:52:50.950235"]]
---
  def create
    @entry = Entry.find_by(id: params[:comment][:entry_id])
    @comment = @entry.comments.build(entry_params)
    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    Comment.find_by(id: params[:id]).destroy